[Killed] ObjectLiteral
main/components/Nav/AppNavbar.js:31:73
       }
       <Navbar expand="xl" variant="dark" sticky="top" data-testid="AppNavbar" style={styles.navbar}>
         <Container>
-        <img data-testid="AppNavbarImage" src={headerImg} alt="" style={{width: 80, height: 80, marginRight: 10}} />
+        <img data-testid="AppNavbarImage" src={headerImg} alt="" style={{}} />
           <Navbar.Brand as={Link} to="/">
             GauchoRide
killedBy: AppNavbar tests renders image correctly
statusReason: Error: expect(element).toHaveAttribute("style", "width: 80px; height: 80px; margin-right: 10px;") // element.getAttribute("style") === "width: 80px; height: 80px; margin-right: 10px;"

Expected the element to have attribute:
  style="width: 80px; height: 80px; margin-right: 10px;"
Received:
  null
