[Killed] StringLiteral
main/components/Ride/RideForm.js:21:26
     );
     // Stryker restore all
    
-    const testIdPrefix = "RideForm";
+    const testIdPrefix = "";
 
     return (
killedBy: RideForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RideForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Ride/RideForm.js:63:22
                 <option value="Sunday">Sunday</option>
                 </Form.Select>
                 <Form.Control.Feedback type="invalid">
-                    {errors.day?.message}
+                    {errors.day.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Survived] StringLiteral
main/components/Ride/RideForm.js:70:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="start">Start Time</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-start"}
+                    data-testid={testIdPrefix + ""}
                     id="start"
                     type="text"

[Survived] StringLiteral
main/components/Ride/RideForm.js:75:35
                     type="text"
                     isInvalid={Boolean(errors.start)}
                     {...register("start", {
-                        required: "Start time is required.",
+                        required: "",
                         pattern: {
                             value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,

[Killed] OptionalChaining
main/components/Ride/RideForm.js:84:22
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start?.message}
+                    {errors.start.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Survived] ObjectLiteral
main/components/Ride/RideForm.js:95:41
                     id="end"
                     type="text"
                     isInvalid={Boolean(errors.start) }
-                    {...register("end", {
-                        required: "End time is required.",
-                        pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
-                          }
-                    })}
+                    {...register("end", {})}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"      
                 />

[Survived] Regex
main/components/Ride/RideForm.js:98:36
                     {...register("end", {
                         required: "End time is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0?[^1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           }

[Survived] Regex
main/components/Ride/RideForm.js:98:36
                     {...register("end", {
                         required: "End time is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           }

[Killed] OptionalChaining
main/components/Ride/RideForm.js:105:22
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"      
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.end?.message}
+                    {errors.end.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Ride/RideForm.js:116:34
                     id="pickup"
                     type="text"
                     isInvalid={Boolean(errors.pickup)}
-                    {...register("pickup", {
+                    {...register("", {
                         required: "Pick Up Location is required."
                     })}
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Survived] StringLiteral
main/components/Ride/RideForm.js:117:35
                     type="text"
                     isInvalid={Boolean(errors.pickup)}
                     {...register("pickup", {
-                        required: "Pick Up Location is required."
+                        required: ""
                     })}
                     placeholder="e.g. Anacapa Residence Hall"  

[Killed] OptionalChaining
main/components/Ride/RideForm.js:122:22
                     placeholder="e.g. Anacapa Residence Hall"  
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.pickup?.message}
+                    {errors.pickup.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Ride/RideForm.js:139:22
                     placeholder="e.g. Phelps"  
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dropoff?.message}
+                    {errors.dropoff.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Ride/RideForm.js:156:22
                     placeholder="e.g. 2225"  
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.room?.message}
+                    {errors.room.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Ride/RideForm.js:173:22
                     placeholder="e.g. CMPSC 156"  
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.course?.message}
+                    {errors.course.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
