[Killed] BlockStatement
main/components/Ride/RideTable.js:15:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ride_request/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RideTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride_request/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Ride/RideTable.js:59:23
         },
         {
             Header: 'End Time',
-            accessor: 'end',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-end"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:61:9
             Header: 'End Time',
             accessor: 'end',
         },
-        {
-            Header: 'Pick Up',
-            accessor: 'pickup',
-        },
+        {},
         {
             Header: 'Drop Off',
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:92:9
             Header: 'Course #',
             accessor: 'course',
         },
-        {
-            Header: 'Start Time',
-            accessor: 'start',
-        },
+        {},
         {
             Header: 'End Time',
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:102:23
         },
         {
             Header: 'Pick Up',
-            accessor: 'pickup',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-pickup"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:135:9
             Header: 'Start Time',
             accessor: 'start',
         },
-        {
-            Header: 'End Time',
-            accessor: 'end',
-        },
+        {},
         {
             Header: 'Pick Up',
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:143:9
             Header: 'Pick Up',
             accessor: 'pickup',
         },
-        {
-            Header: 'Drop Off',
-            accessor: 'dropoff',
-        },
+        {},
         {
             Header: 'Room #',
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
