[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:74:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
-                    <NavDropdown.Item as={Link} to="/ride/">Rides</NavDropdown.Item>
-                    {
-                      (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                        <NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>
-                      )
-                    }
-                    </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:74:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
-                    <NavDropdown.Item as={Link} to="/ride/">Rides</NavDropdown.Item>
-                    {
-                      (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                        <NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>
-                      )
-                    }
-                    </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:78:24
                   <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
                     <NavDropdown.Item as={Link} to="/ride/">Rides</NavDropdown.Item>
                     {
-                      (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) && (
+                      (hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_ADMIN")) && (
                         <NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>
                       )
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ride-create-dropdown/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:78:23
                   <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
                     <NavDropdown.Item as={Link} to="/ride/">Rides</NavDropdown.Item>
                     {
-                      (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                        <NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>
-                      )
+                      true
                     }
                     </NavDropdown>
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ride-create-dropdown/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
