[Killed] BlockStatement
main/components/Users/UsersTable.js:33:50
 
 
     //toggleDriver
-    function cellToAxiosParamsToggleDriver(cell) {
-        return {
-            url: "/api/admin/users/toggleDriver",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleDriver(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:64:9
             Header: 'First Name',
             accessor: 'givenName',
         },
-        {
-            Header: 'Last Name',
-            accessor: 'familyName',
-        },
+        {},
         {
             Header: 'Email',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:66:23
         },
         {
             Header: 'Last Name',
-            accessor: 'familyName',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-familyName"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:74:17
         },
         {
             Header: 'Admin',
-            id: 'admin',
+            id: "",
             accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
         },
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-admin"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:77:9
             id: 'admin',
             accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
         },
-        {
-            Header: 'Driver',
-            id: 'driver',
-            accessor: (row, _rowIndex) => String(row.driver) // hack needed for boolean values to show up
-        }
+        {}
     ];
 
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:78:21
             accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
         },
         {
-            Header: 'Driver',
+            Header: "",
             id: 'driver',
             accessor: (row, _rowIndex) => String(row.driver) // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Users/UsersTable.js:80:23
         {
             Header: 'Driver',
             id: 'driver',
-            accessor: (row, _rowIndex) => String(row.driver) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         }
     ];
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
