[Killed] ArrayDeclaration
main/components/Shift/ShiftTable.js:8:21
 
 export default function ShiftTable({ shift }) {
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-        {
-            Header: 'day',
-            accessor: 'day',
-        },
-        {
-            Header: 'shift',
-            accessor: 'shift',
-        },
-        {
-            Header: 'driver',
-            accessor: 'driver'
-        },
-        {
-            Header: 'driver backup',
-            accessor: 'driverBackup',
-        }
-    ];
+    const columns = [];
 
     return <OurTable
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:18:21
             accessor: 'day',
         },
         {
-            Header: 'shift',
+            Header: "",
             accessor: 'shift',
         },
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: shift. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
