[Killed] BlockStatement
main/pages/Ride/RideRequestIndexPage.js:10:48
 import Button from 'react-bootstrap/Button';
 import { Link } from 'react-router-dom';
 
-export default function RideRequestIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: rides, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/ride_request/all"],
-    { method: "GET", url: "/api/ride_request/all" },
-    []
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/rideRequest/create">
-          Create Ride Request
-        </Button>
-        <h1>Ride Requests</h1>
-        <RideTable ride={rides} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RideRequestIndexPage() {}
killedBy: RideRequestIndexPage tests renders without crashing for regular user
statusReason: Error: RideRequestIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Ride/RideRequestIndexPage.js:18:27
   useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ride_request/all"],
-    { method: "GET", url: "/api/ride_request/all" },
+    { method: "GET", url: "" },
     []
   );
killedBy: RideRequestIndexPage tests renders three rides without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/Ride/RideRequestIndexPage.js:19:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ride_request/all"],
     { method: "GET", url: "/api/ride_request/all" },
-    []
+    ["Stryker was here"]
   );
 
killedBy: RideRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RideTable-cell-row-0-col-id" role="cell" /> instead
